toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
#define TaskARM32
#include "Toastbox/Task.h"
#include "Toastbox/IntState.h"
#include "Assert.h"
#include "System.h"
#include "ICE.h"
#include "STM.h"
#include "USB.h"
#include "QSPI.h"
#include "Battery.h"
#include "BufQueue.h"
#include "SDCard.h"
#include "ImgSensor.h"
#include "ImgSD.h"
#include "USBConfigDesc.h"
#include "MSP430JTAG.h"
#include "TaskCmdRecv.h"
#include "TaskCmdHandle.h"
#include "TaskMSPComms.h"
using namespace STM;

struct _Scheduler;

static void _CmdHandle(const STM::Cmd& cmd);
static void _TasksReset();

[[noreturn]]
static void _SchedulerError(uint16_t line);
static const void* _USBConfigDesc(size_t& len);

struct _USB : USBType<
    _Scheduler,
    true,                       // T_DMAEn
    _USBConfigDesc,             // T_ConfigDesc
    STM::Endpoints::DataOut,    // T_Endpoints
    STM::Endpoints::DataIn
> {};

struct _System : System<
    _Scheduler,
    _USB,
    STM::Status::Modes::STMApp,
    _CmdHandle,
    _TasksReset
> {};

using _I2C = _System::I2C;

using _TaskCmdHandle = _System::_TaskCmdHandle;

using _TaskCmdRecv = _System::_TaskCmdRecv;

struct _TaskMSPComms : TaskMSPComms<
    _Scheduler,
    _I2C
> {};

struct _TaskUSBDataOut;
struct _TaskUSBDataIn;
struct _TaskReadout;

#warning TODO: remove stack guards for production
struct _Scheduler : Toastbox::Scheduler<
    _UsPerSysTick,                              // T_UsPerTick: microseconds per tick
    Toastbox::IntState::SetInterruptsEnabled,   // T_SetInterruptsEnabled: function to change interrupt state
    _Sleep,                                     // T_Sleep: function to put processor to sleep;
                                                //          invoked when no tasks have work to do
    _SchedulerError,                            // T_Error: function to call upon an unrecoverable error (eg stack overflow)
    _StackMain,                                 // T_MainStack: main stack pointer (only used to monitor
                                                //              main stack for overflow; unused if T_StackGuardCount==0)
    4,                                          // T_StackGuardCount: number of pointer-sized stack guard elements to use
    _TaskCmdRecv,                               // T_Tasks: list of tasks
    _TaskCmdHandle,
    _TaskMSPComms,
    _TaskUSBDataOut,
    _TaskUSBDataIn,
    _TaskReadout
> {};

static const void* _USBConfigDesc(size_t& len) {
    return USBConfigDesc<_USB>(len);
}

[[noreturn]]
static void _SchedulerError(uint16_t line) {
    _System::Abort();
}

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static void _BufQueueAssert(bool c) { Assert(c); }
using _BufQueue = BufQueue<uint8_t, 63*1024, 2, _BufQueueAssert>;

#warning TODO: were not putting the _BufQueue code in .sram1 too are we?
[[gnu::section(".sram1")]]
static _BufQueue _Bufs;

static QSPI _QSPI;
static Battery<_Scheduler> _Battery;

using _ICE_CRST_            = GPIO<GPIOPortF, 11>;
using _ICE_CDONE            = GPIO<GPIOPortB, 1>;
using _ICE_ST_SPI_CS_       = GPIO<GPIOPortE, 12>;
using _ICE_ST_SPI_D_READY   = GPIO<GPIOPortA, 3>;
using _ICE_ST_FLASH_EN      = GPIO<GPIOPortF, 5>;
using _ICE_ST_SPI_CLK       = QSPI::Clk;
using _ICE_ST_SPI_D4        = QSPI::D4;
using _ICE_ST_SPI_D5        = QSPI::D5;
using _MSP_TEST             = GPIO<GPIOPortG, 11>;
using _MSP_RST_             = GPIO<GPIOPortG, 12>;

[[noreturn]] static void _ICEError(uint16_t line);
using _ICE = ::ICE<_Scheduler, _ICEError>;

[[noreturn]] static void _ImgError(uint16_t line);
using _ImgSensor = Img::Sensor<
    _Scheduler, // T_Scheduler
    _ICE,       // T_ICE
    _ImgError   // T_Error
>;

[[noreturn]] static void _SDError(uint16_t line);
using _SDCard = SD::Card<
    _Scheduler, // T_Scheduler
    _ICE,       // T_ICE
    _SDError,   // T_Error
    1,          // T_ClkDelaySlow (odd values invert the clock)
    0           // T_ClkDelayFast (odd values invert the clock)
>;

class _SD {
public:
    static void Reset() {
        _SDCard::Reset();
    }
    
    static void Init() {
        _Reading = false;
        _RCA = _SDCard::Init(&_CardId, &_CardData);
    }
    
    static const SD::CardId& CardId() {
        return _CardId;
    }
    
    static const SD::CardData& CardData() {
        return _CardData;
    }
    
    static void ReadStart(uint32_t blockIdx) {
        if (_Reading) ReadStop(); // Stop current read if one is in progress
        
        _Reading = true;
        _SDCard::ReadStart(blockIdx);
    }
    
    static void ReadStop() {
        _Reading = false;
        _SDCard::ReadStop();
    }
    
private:
    static inline uint16_t _RCA = 0;
    alignas(4) static inline SD::CardId _CardId;
    alignas(4) static inline SD::CardData _CardData;
    static inline bool _Reading = false;
};

// MARK: - Utility Functions

static bool _VDDIMGSDSet(bool en) {
    const MSP::Cmd mspCmd = {
        .op = MSP::Cmd::Op::VDDIMGSDSet,
        .arg = {
            .VDDIMGSDSet = {
                .en = en,
            },
        },
    };
    
    const MSP::Resp mspResp = _TaskMSPComms::Send(mspCmd);
    if (!mspResp.ok) return false;
    return true;
}

// MARK: - ICE40

namespace _QSPICmd {

static QSPI_CommandTypeDef ICEWrite(size_t len) {
    return QSPI_CommandTypeDef{
        .Instruction = 0,
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        
        .Address = 0,
        .AddressSize = QSPI_ADDRESS_8_BITS,
        .AddressMode = QSPI_ADDRESS_NONE,
        
        .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        
        .DummyCycles = 0,
        
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_1_LINE,
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static QSPI_CommandTypeDef ICEApp(const _ICE::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
