toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    static void Run() {
        for (;;) {
            _Scheduler::Wait([] { return _Bufs.rok(); });
            
            // Send the data and wait until the transfer is complete
            auto& buf = _Bufs.rget();
            const bool br = _USB::Send(Endpoints::DataIn, buf.data, buf.len);
            if (!br) break;
            
            buf.len = 0;
            _Bufs.rpop();
        }
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataIn")]]
    static inline uint8_t Stack[256];
};

struct _TaskUSBDataOut {
    static void Start(size_t len) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_TaskUSBDataOut>());
        _Len = len;
        _Scheduler::Start<_TaskUSBDataOut>();
    }
    
    static void Run() {
        size_t len = _Len;
        for (;;) {
            _Scheduler::Wait([] { return _Bufs.wok(); });
            
            auto& buf = _Bufs.wget();
            if (!len) {
                // Signal EOF when there's no more data to receive
                buf.len = 0;
                _Bufs.wpush();
                break;
            }
            
            // Prepare to receive either `len` bytes or the buffer capacity bytes,
            // whichever is smaller.
            const size_t cap = _USB::CeilToMaxPacketSize(_USB::MaxPacketSizeOut(), std::min(len, sizeof(buf.data)));
            // Ensure that after rounding up to the nearest packet size, we don't
            // exceed the buffer capacity. (This should always be safe as long as
            // the buffer capacity is a multiple of the max packet size.)
            Assert(cap <= sizeof(buf.data));
            const std::optional<size_t> recvLenOpt = _USB::Recv(Endpoints::DataOut, buf.data, cap);
            #warning TODO: handle errors somehow
            if (!recvLenOpt) break;
            
            // Never claim that we read more than the requested data, even if ceiling
            // to the max packet size caused us to read more than requested.
            const size_t recvLen = std::min(len, *recvLenOpt);
            len -= recvLen;
            buf.len = recvLen;
            _Bufs.wpush();
        }
    }
    
    static inline size_t _Len = 0;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack.TaskUSBDataOut")]]
    static inline uint8_t Stack[256];
};

struct _TaskReadout {
    static void Start(std::optional<size_t> len) {
        _RemLen = len;
        _Scheduler::Start<_TaskReadout>();
    }
    
    static void Run() {
        // Reset state
        _Bufs.reset();
        // Start the USB DataIn task
        _TaskUSBDataIn::Start();
        
        // Send the Readout message, which causes us to enter the readout mode until
        // we release the chip select
        _ICE_ST_SPI_CS_::Write(0);
        _QSPI.command(_QSPICmd::ICEApp(_ICE::ReadoutMsg(), 0));
        
        // Read data over QSPI and write it to USB, indefinitely
        for (;;) {
            // Wait until: there's an available buffer, QSPI is ready, and ICE40 says data is available
            _Scheduler::Wait([] { return _Bufs.wok() && _QSPI.ready(); });
            
            const size_t len = std::min(_RemLen.value_or(SIZE_MAX), _ICE::ReadoutMsg::ReadoutLen);
            auto& buf = _Bufs.wget();
            
            // If there's no more data to read, bail
            if (!len) {
                // Before bailing, push the final buffer if it holds data
                if (buf.len) _Bufs.wpush();
                break;
            }
            
            // If we can't read any more data into the producer buffer,
            // push it so the data will be sent over USB
            if (sizeof(buf.data)-buf.len < len) {
                _Bufs.wpush();
                continue;
            }
            
            // Wait until ICE40 signals that data is ready to be read
            #warning TODO: we should institute yield after some number of retries to avoid crashing the system if we never get data
            while (!_ICE_ST_SPI_D_READY::Read());
            
            _QSPI.read(_QSPICmd::ICEAppReadOnly(len), buf.data+buf.len);
            buf.len += len;
            
            if (_RemLen) *_RemLen -= len;
        }
    }
    
    static inline std::optional<size_t> _RemLen;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskReadout")]]
    static inline uint8_t Stack[512];
};

// MARK: - Commands

static void _ICERAMWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.ICERAMWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure ICE40 control GPIOs
    _ICE_CRST_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_CDONE::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_FLASH_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
    // Disable flash
    _ICE_ST_FLASH_EN::Write(0);
    
    // Put ICE40 into configuration mode
    _ICE_ST_SPI_CLK::Write(1);
    
    _ICE_ST_SPI_CS_::Write(0);
    _ICE_CRST_::Write(0);
    _Scheduler::Sleep(_Scheduler::Ms(1)); // Sleep 1 ms (ideally, 200 ns)
    
    _ICE_CRST_::Write(1);
    _Scheduler::Sleep(_Scheduler::Ms(2)); // Sleep 2 ms (ideally, 1.2 ms for 8K devices)
    
    // Configure QSPI for writing the ICE40 configuration
    _QSPISetConfig(_QSPIConfigs::ICEWrite);
    
    // Send 8 clocks and wait for them to complete
    static const uint8_t ff = 0xff;
    _QSPI.write(_QSPICmd::ICEWrite(sizeof(ff)), &ff);
    _Scheduler::Wait([] { return _QSPI.ready(); });
    
    // Reset state
    _Bufs.reset();
    
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(arg.len);
    
