toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    for (;;) {
        // Wait until we have data to consume, and QSPI is ready to write
        _Scheduler::Wait([] { return _Bufs.rok() && _QSPI.ready(); });
        
        // Write the data over QSPI and wait for completion
        auto& buf = _Bufs.rget();
        if (buf.len) {
            _QSPI.write(_QSPICmd::ICEWrite(buf.len), buf.data);
            _Scheduler::Wait([] { return _QSPI.ready(); });
        }
        _Bufs.rpop();
        if (!buf.len) break; // We're done when we receive an empty buffer
    }
    
    // Wait for CDONE to be asserted
    {
        bool ok = false;
        for (int i=0; i<10 && !ok; i++) {
            if (i) _Scheduler::Sleep(_Scheduler::Ms(1)); // Sleep 1 ms
            ok = _ICE_CDONE::Read();
        }
        
        if (!ok) {
            _System::USBSendStatus(false);
            return;
        }
    }
    
    // Finish
    {
        // Supply >=49 additional clocks (8*7=56 clocks), per the
        // "iCE40 Programming and Configuration" guide.
        // These clocks apparently reach the user application. Since this
        // appears unavoidable, prevent the clocks from affecting the user
        // application by writing 0xFF, which the user application must
        // consider as a NOP.
        constexpr uint8_t ClockCount = 7;
        static int i;
        for (i=0; i<ClockCount; i++) {
            _QSPI.write(_QSPICmd::ICEWrite(sizeof(ff)), &ff);
            _Scheduler::Wait([] { return _QSPI.ready(); });
        }
    }
    
    // Release chip-select now that we're done
    _ICE_ST_SPI_CS_::Write(1);
    
    _System::USBSendStatus(true);
}

static void __ICEFlashIn(uint8_t* d, size_t len) {
    for (size_t i=0; i<len; i++) {
        uint8_t& b = d[i];
        for (int ii=0; ii<8; ii++) {
            _ICE_ST_SPI_CLK::Write(1);
            
            b <<= 1;
            b |= _ICE_ST_SPI_D4::Read();
            
            _ICE_ST_SPI_CLK::Write(0);
        }
    }
}

static void __ICEFlashOut(const uint8_t* d, size_t len) {
    for (size_t i=0; i<len; i++) {
        uint8_t b = d[i];
        for (int ii=0; ii<8; ii++) {
            _ICE_ST_SPI_D5::Write(b & 0x80);
            b <<= 1;
            
            _ICE_ST_SPI_CLK::Write(1);
            _ICE_ST_SPI_CLK::Write(0);
        }
    }
}

//static uint8_t _ICEFlashIn() {
//    _ICE_ST_SPI_CS_::Write(0);
//    uint8_t d = 0;
//    __ICEFlashIn(&d, 1);
//    _ICE_ST_SPI_CS_::Write(1);
//    return d;
//}

static void _ICEFlashOut(uint8_t out) {
    _ICE_ST_SPI_CS_::Write(0);
    __ICEFlashOut(&out, 1);
    _ICE_ST_SPI_CS_::Write(1);
}

static uint8_t _ICEFlashOutIn(uint8_t out) {
    uint8_t in = 0;
    _ICE_ST_SPI_CS_::Write(0);
    __ICEFlashOut(&out, 1);
    __ICEFlashIn(&in, 1);
    _ICE_ST_SPI_CS_::Write(1);
    return in;
}

static void _ICEFlashWait() {
    // Wait until erase is complete
    for (;;) {
        const uint8_t sr1 = _ICEFlashOutIn(0x05);
        const bool busy = (sr1 & 1);
        if (!busy) break;
    }
}

//static void __ICEFlashWriteWrite(uint8_t w, const uint8_t* d, size_t len) {
//    for (int i=0; i<8; i++) {
//        _ICE_ST_SPI_D4::Write(w & 0x80);
//        w <<= 1;
//        
//        _ICE_ST_SPI_CLK::Write(1);
//        _ICE_ST_SPI_CLK::Write(0);
//    }
//}
//
//static void _ICEFlashCmd(const uint8_t* instr, size_t instrLen, const uint8_t* data=nullptr, size_t dataLen=0) {
//    _ICE_ST_SPI_CS_::Write(0);
//    __ICEFlashCmd(instr, instrLen);
//    if (data) __ICEFlashCmd(data, dataLen);
//    _ICE_ST_SPI_CS_::Write(1);
//}
//
//static void _ICEFlashCmd(uint8_t w, const uint8_t* d=nullptr, size_t len=0) {
//    _ICEFlashCmd(&w, 1, d, len);
//}
//
//static uint8_t _ICEFlashCmd(uint8_t w) {
//    _ICE_ST_SPI_CS_::Write(0);
//    __ICEFlashCmd(&w, 1);
//    const uint8_t r = __ICEFlashWriteRead();
//    _ICE_ST_SPI_CS_::Write(1);
//    return r;
//}

static void _ICEFlashRead(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.ICEFlashRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure ICE40 control GPIOs
    _ICE_CRST_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_CDONE::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_FLASH_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D4::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D5::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
    // Hold ICE40 in reset while we write to flash
    _ICE_CRST_::Write(0);
    
    // Set default clock state before enabling flash
    _ICE_ST_SPI_CLK::Write(0);
    
    // De-assert chip select before enabling flash
    _ICE_ST_SPI_CS_::Write(1);
    
    // Enable flash
    _ICE_ST_FLASH_EN::Write(1);
    
    // Reset flash
    _ICEFlashOut(0x66);
    _ICEFlashOut(0x99);
    _Scheduler::Sleep(_Scheduler::Us(32)); // "the device will take approximately tRST=30us to reset"
    
    // Reset state
    _Bufs.reset();
    
    // Start the USB DataIn task
    _TaskUSBDataIn::Start();
    
    _ICE_ST_SPI_CS_::Write(0);
    
    // Start flash read
    {
        const uint8_t instr[] = {
            0x03,
            (uint8_t)((arg.addr&0xFF0000)>>16),
            (uint8_t)((arg.addr&0x00FF00)>>8),
            (uint8_t)((arg.addr&0x0000FF)>>0),
        };
        
        __ICEFlashOut(instr, sizeof(instr));
    }
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    while (len) {
        _Scheduler::Wait([] { return _Bufs.wok(); });
        
        auto& buf = _Bufs.wget();
        // Prepare to receive either `len` bytes or the
        // buffer capacity bytes, whichever is smaller.
        const size_t chunkLen = std::min((size_t)len, sizeof(buf.data));
        __ICEFlashIn(buf.data, chunkLen);
        addr += chunkLen;
        len -= chunkLen;
        // Enqueue the buffer
        buf.len = chunkLen;
        _Bufs.wpush();
    }
    
    // Wait for DataIn task to complete
    _Scheduler::Wait([] { return !_Bufs.rok(); });
    
    // Disable flash
    _ICE_ST_FLASH_EN::Write(0);
    
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_FLASH_EN::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D4::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D5::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
